NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32PG12B/EFM32PG12B500F1024IM48.svd
        <register>
          <name>PPUFS</name>
          <description>PPU Fault Status</description>
          <addressOffset>0x090</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <field>
              <name>PERIPHID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMU</name>
                  <description>Clock Management Unit</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYOTIMER</name>
                  <description>CRYOTIMER</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTO0</name>
                  <description>Advanced Encryption Standard Accelerator 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTO1</name>
                  <description>Advanced Encryption Standard Accelerator 1</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEN</name>
                  <description>Capacitive touch sense module</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0</name>
                  <description>Digital to Analog Converter 0</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS</name>
                  <description>Peripheral Reflex System</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMU</name>
                  <description>Energy Management Unit</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPUEH</name>
                  <description>FPU Exception Handler</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPCRC</name>
                  <description>General Purpose CRC</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>General purpose Input/Output</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <description>I2C 0</description>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1</name>
                  <description>I2C 1</description>
                  <value>0x00000013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAC0</name>
                  <description>Current Digital to Analog Converter 0</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSC</name>
                  <description>Memory System Controller</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDMA</name>
                  <description>Linked Direct Memory Access Controller</description>
                  <value>0x00000016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LESENSE</name>
                  <description>Low Energy Sensor Interface</description>
                  <value>0x00000017</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LETIMER0</name>
                  <description>Low Energy Timer 0</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEUART0</name>
                  <description>Low Energy UART 0</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCNT0</name>
                  <description>Pulse Counter 0</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCNT1</name>
                  <description>Pulse Counter 1</description>
                  <value>0x0000001C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCNT2</name>
                  <description>Pulse Counter 2</description>
                  <value>0x0000001D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMU</name>
                  <description>Reset Management Unit</description>
                  <value>0x00000021</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCC</name>
                  <description>Real-Time Counter and Calendar</description>
                  <value>0x00000022</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMU</name>
                  <description>Security Management Unit</description>
                  <value>0x00000023</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x00000025</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x00000026</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRNG0</name>
                  <description>True Random Number Generator 0</description>
                  <value>0x00000027</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x00000028</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x00000029</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 2</description>
                  <value>0x0000002A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART3</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 3</description>
                  <value>0x0000002B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG0</name>
                  <description>Watchdog 0</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG1</name>
                  <description>Watchdog 1</description>
                  <value>0x0000002D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WTIMER0</name>
                  <description>Wide Timer 0</description>
                  <value>0x0000002E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WTIMER1</name>
                  <description>Wide Timer 1</description>
                  <value>0x0000002F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
